In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])#Series中可以有不同类型元素，这里因为np.nan是float类型，所以整个series的dtype也是float
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))#list('abcd')=['a','b','c','d']
df

                   A         B         C         D
2013-01-01  1.803119  1.156321  0.212797  0.107303
2013-01-02  0.988351  0.806464  0.408151  0.768312
2013-01-03  0.811154  0.697112  1.571154 -0.238597
2013-01-04  0.280339  0.889827 -0.061415  1.105962
2013-01-05 -1.432135  0.683448 -0.284408 -1.215106
2013-01-06 -0.567270 -0.289479 -0.214911 -0.345192

In [5]:
df2 = pd.DataFrame({'A': 1.,#等于该列全部赋值1.0
                    'B': pd.Timestamp('20130102'),#等于该列全部赋值Timestamp'20130102'
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),#arrays must all be same length。series全部赋值1，其中range()返回range类型，等差数列
                    'D': np.array([3] * 4, dtype='int32'),#list*4=list重复4次
                    'E': pd.Categorical(["test", "train", "test", "train"]),#arrays must all be same length。类别数据，有限取值，大量重复
                    #写法2：pd.Series(["test", "train", "test", "train"], dtype='category')
                    'F': 'foo'})#等于该列全部赋值'foo'
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [7]:
df.head()#Number of rows to select.default 5

                   A         B         C         D
2013-01-01  1.803119  1.156321  0.212797  0.107303
2013-01-02  0.988351  0.806464  0.408151  0.768312
2013-01-03  0.811154  0.697112  1.571154 -0.238597
2013-01-04  0.280339  0.889827 -0.061415  1.105962
2013-01-05 -1.432135  0.683448 -0.284408 -1.215106

In [8]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.280339  0.889827 -0.061415  1.105962
2013-01-05 -1.432135  0.683448 -0.284408 -1.215106
2013-01-06 -0.567270 -0.289479 -0.214911 -0.345192

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.to_numpy()

array([[ 1.80311882,  1.15632057,  0.21279733,  0.10730347],
       [ 0.988351  ,  0.80646444,  0.40815144,  0.76831223],
       [ 0.81115422,  0.69711235,  1.57115366, -0.23859687],
       [ 0.28033913,  0.88982724, -0.06141545,  1.10596205],
       [-1.4321351 ,  0.6834482 , -0.28440829, -1.21510571],
       [-0.56726951, -0.28947936, -0.21491054, -0.34519238]])

In [12]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.313926  0.657282  0.271895  0.030447
std    1.161563  0.494773  0.688140  0.833304
min   -1.432135 -0.289479 -0.284408 -1.215106
25%   -0.355367  0.686864 -0.176537 -0.318544
50%    0.545747  0.751788  0.075691 -0.065647
75%    0.944052  0.868987  0.359313  0.603060
max    1.803119  1.156321  1.571154  1.105962

In [14]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.803119    0.988351    0.811154    0.280339   -1.432135   -0.567270
B    1.156321    0.806464    0.697112    0.889827    0.683448   -0.289479
C    0.212797    0.408151    1.571154   -0.061415   -0.284408   -0.214911
D    0.107303    0.768312   -0.238597    1.105962   -1.215106   -0.345192

In [15]:
df.sort_index(axis=1, ascending=False)#默认0按index排序，1为按column，默认ascending=True正序，返回新对象，原df不变

                   D         C         B         A
2013-01-01  0.107303  0.212797  1.156321  1.803119
2013-01-02  0.768312  0.408151  0.806464  0.988351
2013-01-03 -0.238597  1.571154  0.697112  0.811154
2013-01-04  1.105962 -0.061415  0.889827  0.280339
2013-01-05 -1.215106 -0.284408  0.683448 -1.432135
2013-01-06 -0.345192 -0.214911 -0.289479 -0.567270

In [16]:
df.sort_values(by='B')#sort_index的by参数已经禁用，改为sort_values

                   A         B         C         D
2013-01-06 -0.567270 -0.289479 -0.214911 -0.345192
2013-01-05 -1.432135  0.683448 -0.284408 -1.215106
2013-01-03  0.811154  0.697112  1.571154 -0.238597
2013-01-02  0.988351  0.806464  0.408151  0.768312
2013-01-04  0.280339  0.889827 -0.061415  1.105962
2013-01-01  1.803119  1.156321  0.212797  0.107303

In [17]:
df

                   A         B         C         D
2013-01-01  1.803119  1.156321  0.212797  0.107303
2013-01-02  0.988351  0.806464  0.408151  0.768312
2013-01-03  0.811154  0.697112  1.571154 -0.238597
2013-01-04  0.280339  0.889827 -0.061415  1.105962
2013-01-05 -1.432135  0.683448 -0.284408 -1.215106
2013-01-06 -0.567270 -0.289479 -0.214911 -0.345192

In [18]:
df['A']#frame[colname] Series corresponding to colname

2013-01-01    1.803119
2013-01-02    0.988351
2013-01-03    0.811154
2013-01-04    0.280339
2013-01-05   -1.432135
2013-01-06   -0.567270
Freq: D, Name: A, dtype: float64

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01  1.803119  1.156321  0.212797  0.107303
2013-01-02  0.988351  0.806464  0.408151  0.768312
2013-01-03  0.811154  0.697112  1.571154 -0.238597

In [20]:
df[dates[1]:dates[3]]

                   A         B         C         D
2013-01-02  0.988351  0.806464  0.408151  0.768312
2013-01-03  0.811154  0.697112  1.571154 -0.238597
2013-01-04  0.280339  0.889827 -0.061415  1.105962

In [21]:
df['A']#equivalent to df.A,[‘列名称’]，只能一个不可为list，对于int类型的列名称，不能用df.列名称代替，只有字符串可以

2013-01-01    1.803119
2013-01-02    0.988351
2013-01-03    0.811154
2013-01-04    0.280339
2013-01-05   -1.432135
2013-01-06   -0.567270
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]#行切片，数字代表序号，从0开始，左包含右不包含

                   A         B         C         D
2013-01-01  1.803119  1.156321  0.212797  0.107303
2013-01-02  0.988351  0.806464  0.408151  0.768312
2013-01-03  0.811154  0.697112  1.571154 -0.238597

In [23]:
df['20130102':'20130104':2]#行切片，第一个冒号前为index，左右都包含，如果index为int，不能采用此格式，会识别为序号

                   A         B         C         D
2013-01-02  0.988351  0.806464  0.408151  0.768312
2013-01-04  0.280339  0.889827 -0.061415  1.105962

In [24]:
df.loc[dates[0]]#loc（index切片,column切片）,只能用index和column，不能用序号，用序号是iloc

A    1.803119
B    1.156321
C    0.212797
D    0.107303
Name: 2013-01-01 00:00:00, dtype: float64

In [25]:
df.loc[::2, ['A', 'B']]

                   A         B
2013-01-01  1.803119  1.156321
2013-01-03  0.811154  0.697112
2013-01-05 -1.432135  0.683448

In [26]:
df.loc['20130102':'20130104', ['A', 'B']]#左右都包含

                   A         B
2013-01-02  0.988351  0.806464
2013-01-03  0.811154  0.697112
2013-01-04  0.280339  0.889827

In [27]:
df.loc[dates[0], 'A']

1.80311881882967

In [28]:
df.at[dates[0], 'A']#equivalent to the prior method

1.80311881882967

In [29]:
df

                   A         B         C         D
2013-01-01  1.803119  1.156321  0.212797  0.107303
2013-01-02  0.988351  0.806464  0.408151  0.768312
2013-01-03  0.811154  0.697112  1.571154 -0.238597
2013-01-04  0.280339  0.889827 -0.061415  1.105962
2013-01-05 -1.432135  0.683448 -0.284408 -1.215106
2013-01-06 -0.567270 -0.289479 -0.214911 -0.345192

In [30]:
df.iloc[3]#loc（index切片,column切片）,只能用序号

A    0.280339
B    0.889827
C   -0.061415
D    1.105962
Name: 2013-01-04 00:00:00, dtype: float64

In [31]:
df.iloc[3:5, 0:2]#左包含右不包含

                   A         B
2013-01-04  0.280339  0.889827
2013-01-05 -1.432135  0.683448

In [32]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.988351  0.408151
2013-01-03  0.811154  1.571154
2013-01-05 -1.432135 -0.284408

In [33]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.988351  0.806464  0.408151  0.768312
2013-01-03  0.811154  0.697112  1.571154 -0.238597

In [34]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.156321  0.212797
2013-01-02  0.806464  0.408151
2013-01-03  0.697112  1.571154
2013-01-04  0.889827 -0.061415
2013-01-05  0.683448 -0.284408
2013-01-06 -0.289479 -0.214911

In [35]:
df.iloc[1, 1]

0.8064644389253953

In [36]:
df.iat[1, 1]#equivalent to the prior method

0.8064644389253953